app/controllers/chatrooms_controller.rb

SELECT "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
---
  def show
    @current_user = current_user
    @single_room = Chatroom.find(params[:id])

INSERT INTO "chatrooms" ("name", "is_private", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", nil], ["is_private", false], ["created_at", "2023-08-16 09:53:09.440158"], ["updated_at", "2023-08-16 09:53:09.440158"]]
---
  def create
    @chatroom = Chatroom.new(chatroom_params)
    if @chatroom.save