app/controllers/messages_controller.rb

INSERT INTO "messages" ("content", "user_id", "chatroom_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "yes sir"], ["user_id", 1], ["chatroom_id", 3], ["created_at", "2023-08-15 13:36:24.197570"], ["updated_at", "2023-08-15 13:36:24.197570"]]
---
  def create
    @current_user = current_user
    @message = @current_user.messages.new(content: msg_params[:content], chatroom_id: params[:chatroom_id])
    @message.save