app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
      @users = User.where.not(id: current_user.id)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
INSERT INTO "chatrooms" ("name", "is_private", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "private_1_2"], ["is_private", true], ["created_at", "2023-08-16 05:12:44.440608"], ["updated_at", "2023-08-16 05:12:44.440608"]]
SELECT "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."name" = $1 ORDER BY "chatrooms"."id" ASC LIMIT $2  [["name", "private_1_2"], ["LIMIT", 1]]
---
    def show
      @user = User.find(params[:id])
      @current_user = current_user
      @chatrooms = Chatroom.public_rooms
      @users = User.all_except(@current_user)
      @chatroom = Chatroom.new
      @message = Message.new
      @chatroom_name = get_name(@user, @current_user)
      @single_room = Chatroom.where(name: @chatroom_name).first || Chatroom.create_private_room([@user, @current_user], @chatroom_name)