app/models/chatroom.rb

      def self.create_private_room(users, chatroom_name)
        single_room = Chatroom.create(name: chatroom_name, is_private: true)
        users.each do |user|
          Participant.create(user_id: user.id, chatroom_id: single_room.id )
---
INSERT INTO "chatrooms" ("name", "is_private", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "private_1_2"], ["is_private", true], ["created_at", "2023-08-16 05:12:44.440608"], ["updated_at", "2023-08-16 05:12:44.440608"]]
INSERT INTO "participants" ("user_id", "chatroom_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["chatroom_id", 11], ["created_at", "2023-08-16 05:12:44.470749"], ["updated_at", "2023-08-16 05:12:44.470749"]]