app/models/message.rb

SELECT "participants".* FROM "participants" WHERE "participants"."user_id" = $1 AND "participants"."chatroom_id" = $2 ORDER BY "participants"."id" ASC LIMIT $3  [["user_id", 1], ["chatroom_id", 12], ["LIMIT", 1]]
---
  def confirm_participant
    if self.chatroom.is_private
      is_participant = Participant.where(user_id: self.user.id, chatroom_id: self.chatroom.id).first